WcfServicesApp/WcfServicesApp.WcfServiceLib/XML_Soap_Body_Send.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
    <SOAP-ENV:Body>
        <HelloWorld xmlns="http://tempuri.org/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <int1 xsi:type="xsd:integer">12</int1>
            <int2 xsi:type="xsd:integer">32</int2>
        </HelloWorld>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>